/* Keyblob Formats. */

/* The key is a combination of the numeric values of the keyblob type and keyblob format, separated by a hyphen.  This is to get around the unfortunate design error of using overlapping enums for formats of different types.  The numeric values understand are those in cssmtype.h in Apple's Security framework.  Last updated for 10.3.9. */
/* The value is human-readable name for the format, generally a single word. */

/* Standard types defined by the CDSA spec. */

"0-0" = "None";
"0-1" = "RSA PKCS1 (v1.5)";
"0-2" = "RSA PKCS3 (v1.5)";
"0-3" = "Microsoft CAPI (v2)";
"0-4" = "PGP V";
"0-5" = "US Government FIPS 186 - DSS V";
"0-6" = "RSA Bsafe (v3)";
"0-9" = "CCA clear public key blob";
"0-10" = "RSA PKCS8 (v1.2)";
"0-11" = "SPKI Specification";
"0-12" = "Octet String";

"2-0" = "Integer (e.g. handle)";
"2-1" = "String (e.g. label)";
"2-2" = "SPKI S-expression";

"3-0" = "None";
"3-1" = "RSA PKCS8 (v1.2)";
"3-2" = "RSA PKCS7";
"3-3" = "Microsoft CAPI";

/* Apple Custom types. */

"0-2147483648" = "X509 SubjectPublicKeyInfo";
"0-2147483649" = "OpenSSH";
"0-2147483650" = "OpenSSL";